 ## 서블릿(Servlet)
- 자바 언어로 구현되는 서버 프로그램
- Controller 페이지를 만들 때 사용
- 클라이언트가 웹 브라우저를 통해 요청하며 서버에서 실행 후, 결과값만 클라이언트로 전송
- HTTP 프로토콜로 통신하는 웹의 특징, 속성을 자유롭게 사용할 수 있는 API 제공

## JSP(JavaServer Page)
- HTML 페이지 안에서 스크립트 형태로 구현
- View 페이지를 만들 때 사용

---

# 컨테이너(Container)
서블릿과 JSP와 같은 웹서버 애플리케이션은 동적 컨텐츠를 생성하는 웹 컴포넌트
이러한 웹 컴포넌트를 저장하는 저장소 역할, 메모리 로딩, 객체 생성 및 초기화 등 서블릿의 생명주기를 관리하고  JSP를 서블릿으로 변환하는 기능을 수행하는 프로그램이 컨테이너

## 서블릿 컨테이너
서블릿을 수행하려면 다음과 같은 환경 구성 필요
1. 자바 수행 환경
2. 웹서버
3. 서블릿 컨테이너
서블릿 컨테이너는 클라이언트의 요청에 따라 서블릿을 수행하는 프로그램

## JSP 컨테이너
JSP를 수행하려면 다음과 같은 환경 구성 필요
1. 자바 수행 환경
2. 웹서버
3. 서블릿 컨테이너
4. JSP 컨테이너

- JSP 컨테이너는 JSP를 서블릿으로 변환하는 프로그램
- 서블릿으로 구현된 프로그램
- JSP 파일을 서블릿 소스로 변환 및 컴파일까지 담당
- 변환된 서블릿의 수행은 서블릿 컨테이너가 담당
